Revit 2027 API
BuiltInFailures.RebarSystemFailures.BarsTooSparseSpacing Property
 Bar spacing is greater than the size of the reinforced region. Decrease the Maximum Spacing parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BarsTooSparseSpacing { get; }
Public Shared ReadOnly Property BarsTooSparseSpacing As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BarsTooSparseSpacing {
	FailureDefinitionId^ get ();
}
static member BarsTooSparseSpacing : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace